from sympy import *
import numpy as np
from numpy.typing import NDArray
from numpy.linalg import inv as inv


# Зануляем поглощающие строки
Q = np.array([[0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0.2, 0, 0, 0, 0.3, 0, 0.5, 0],
              [0.2, 0.1, 0, 0.2, 0.1, 0.2, 0, 0.2],
              [0.1, 0.2, 0.3, 0.2, 0.2, 0, 0, 0],
              [0, 0.4, 0, 0.1,  0.3, 0, 0, 0.2],
              [0.1, 0.1, 0.2, 0.1, 0.2, 0.1, 0.1, 0.1],
              [0, 0, 0, 0, 0, 0, 0, 0]])

# Expectation
N = inv(np.eye(8, 8) - Q)
print(np.sum(Q[-3] @ N))  # Взять Q[i] в соответствии с изначальным состоянием


# Занулить непоглощающие состояния
# Absorb in any state
R = np.array([[1, 0, 0, 0, 0, 0, 0, 0],
              [0, 1, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 0],
              [0, 0, 0, 0, 0, 0, 0, 1]])

print((N @ R)[-3])  # Взять Q[i] в соответствии с изначальным состоянием
